ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/SVD/MDR32FxQI/MDR32FG16S1QI.svd
                <register derivedFrom="SEP_FIFO0_RXFC">
                    <name>SEP_FIFO1_RXFC</name>
                    <addressOffset>0x000001A8</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFD">
                    <name>SEP_FIFO1_TXFD</name>
                    <addressOffset>0x000001D8</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFDC">
                    <name>SEP_FIFO1_TXFDC</name>
                    <addressOffset>0x000001E8</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFD">
                    <name>SEP_FIFO2_RXFD</name>
                    <addressOffset>0x000001B0</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_L">
                    <name>SEP_FIFO2_RXFDC_L</name>
                    <addressOffset>0x000001B8</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_H">
                    <name>SEP_FIFO2_RXFDC_H</name>
                    <addressOffset>0x000001BC</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFC">
                    <name>SEP_FIFO2_RXFC</name>
                    <addressOffset>0x00000290</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFD">
                    <name>SEP_FIFO2_TXFD</name>
                    <addressOffset>0x000001F0</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFDC">
                    <name>SEP_FIFO2_TXFDC</name>
                    <addressOffset>0x00000200</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFD">
                    <name>SEP_FIFO3_RXFD</name>
                    <addressOffset>0x000001C8</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_L">
                    <name>SEP_FIFO3_RXFDC_L</name>
                    <addressOffset>0x00000308</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_H">
                    <name>SEP_FIFO3_RXFDC_H</name>
                    <addressOffset>0x000001D4</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFC">
                    <name>SEP_FIFO3_RXFC</name>
                    <addressOffset>0x00000310</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFD">
                    <name>SEP_FIFO3_TXFD</name>
                    <addressOffset>0x00000208</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_TXFDC">
                    <name>SEP_FIFO3_TXFDC</name>
                    <addressOffset>0x00000218</addressOffset>
                </register>
                <register>
                    <name>HSCR</name>
                    <description>USB_HSCR Register</description>
                    <addressOffset>0x00000380</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>HOST_MODE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESET_CORE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_TX</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN_RX</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLUP</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DP_PULLDOWN</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLUP</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DM_PULLDOWN</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSVR</name>
                    <description>USB_HSVR Register</description>
                    <addressOffset>0x00000384</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>VERSION</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REVISION</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
